package Lesson_8_1;

public class Director implements Position {
    /*Создать классы "Директор", "Рабочий", "Бухгалтер". Реализовать интерфейс с методом,
    который печатает название должности и имплементировать этот метод в созданные
    классы.*/

    public void printPosition() {
        System.out.println("Директор");
    }
}

